

INSERT INTO journal (reciept_number, employee_id, employee_name, nomenclature_id, nomenclature_name, description, category_id, category_name, transaction_id, transaction_date, amount, total, discount) VALUES
('ЧК001', 1, 'Иванов Иван', 1, 'Чай черный', 'Чай черный', 1, 'Напитки', 1, '2025-02-01 10:30:00', 2, 100, 0),
('ЧК001', 1, 'Иванов Иван', 2, 'Кофе американо', 'Кофе американо', 1, 'Напитки', 1, '2025-02-01 10:30:00', 1, 150, 0),
('ЧК002', 2, 'Петров Петр', 3, 'Борщ', 'Борщ', 2, 'Горячие блюда', 2, '2025-02-01 12:15:00', 2, 300, 0),
('ЧК002', 2, 'Петров Петр', 4, 'Котлета с пюре', 'Котлета с пюре', 2, 'Горячие блюда', 2, '2025-02-01 12:15:00', 1, 250, 0),
('ЧК003', 3, 'Сидорова Анна', 5, 'Сок', 'Сок', 3, 'Напитки', 3, '2025-02-01 13:00:00', 2, 120, 0),
('ЧК003', 3, 'Сидорова Анна', 7, 'Тирамису', 'Тирамису', 4, 'Десерты', 3, '2025-02-01 13:00:00', 1, 200, 0),
('ВОЗ001', 4, 'Козлова Елена', 6,  'Минеральная вода', 'Возврат воды', 3, 'Напитки', 4, '2025-02-01 14:00:00', -1, -50, 0);
